<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="keras_tensor" type="Parameter" version="opset1">
			<data shape="?,7" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="keras_tensor">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Transpose_1908_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 7" offset="0" size="896" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_1908" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="sequential_1/dense_1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_1927_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="896" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_1927" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="sequential_1/dense_1/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="sequential_1/dense_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Transpose_1913_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="46, 64" offset="1024" size="5888" />
			<output>
				<port id="0" precision="FP16">
					<dim>46</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Transpose_1913" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>46</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>46</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="sequential_1/dense_1_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>46</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_1928_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 46" offset="6912" size="92" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_1928" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="sequential_1/dense_1_2/BiasAdd" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>46</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="sequential_1/dense_1_2/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="output_0">
					<dim>-1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="output_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>46</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1" />
		<edge from-layer="3" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.6.0-17404-4c0f47d2335-releases/2024/6" />
		<conversion_parameters>
			<input_model value="D:\AGRISENSEFULL-STACK\agrisense_app\backend\models\crop_recommendation_tf_small" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
