<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,7" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="network.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 7" offset="0" size="1792" />
			<output>
				<port id="0" precision="FP16" names="network.0.weight">
					<dim>128</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="network.0.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="node_linear/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>7</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_1598_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="1792" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_1598" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="node_linear" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="node_relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="network.3.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 128" offset="2048" size="16384" />
			<output>
				<port id="0" precision="FP16" names="network.3.weight">
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="network.3.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="node_linear_1/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_1599_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64" offset="18432" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_1599" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="node_linear_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_1">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="node_relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_1">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="network.6.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 64" offset="18560" size="4096" />
			<output>
				<port id="0" precision="FP16" names="network.6.weight">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="network.6.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="node_linear_2/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_1600_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32" offset="22656" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_1600" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="node_linear_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_2">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="node_relu_2" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_2">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="network.8.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="46, 32" offset="22720" size="2944" />
			<output>
				<port id="0" precision="FP16" names="network.8.weight">
					<dim>46</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="network.8.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>46</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>46</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="node_linear_3/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>46</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_1601_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 46" offset="25664" size="92" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_1601" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="output" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>46</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="output">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="output/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>46</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="3" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1" />
		<edge from-layer="3" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="1" />
		<edge from-layer="24" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="25" from-port="0" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="28" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2024.6.0-17404-4c0f47d2335-releases/2024/6" />
		<Runtime_version value="2024.6.0-17404-4c0f47d2335-releases/2024/6" />
		<conversion_parameters>
			<input_model value="DIR\crop_recommendation_nn_npu.onnx" />
			<is_python_api_used value="True" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
